---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.ClearFilters
source: html/8006e8a9-bf1d-f52d-99eb-9b45ef3c57f6.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ClearFilters Method

Removes all filters.

## Syntax (C#)
```csharp
public void ClearFilters()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This ScheduleDefinition does not support filters.